Repository: wp-plugins/old-core-files
Catalog: languages/ocf-*.po
Languages: sr_rs

source: wp-admin Files
sr_rs: wp-admin datoteke

source: Old Core Files
sr_rs: Old Core datoteke

source: About
sr_rs: O

source: Existing
sr_rs: Postojeći

source: All
sr_rs: Svi

source: We have found some old files in this WordPress installation. Please review the files below.
sr_rs: Našili smo neke stare datoteke u ovoj WordPress instalaciji. Molimo vas da pregledate datoteke koje slede.

source: File
sr_rs: Datoteka

source: Actions
sr_rs: Aktivnosti

source: Delete
sr_rs: Obriši

source: %d files in total
sr_rs: %d ukupno datoteka

source: Delete All
sr_rs: Obriši sve

source: Seems like there are no old files in your installation. Dont forget to delete old WordPress files after each upgrade.
sr_rs: Izgleda da u vašoj instalaciji nema starih datoteka. Ne zaboravite da obrišete stare WordPress datoteke posle svake nadgradnje.

source: What is this about?
sr_rs: O čemu se radi?

source: When core is being upgraded, there are some files that are no longer needed by WordPress, and they are set for removal. On some occasions, PHP/Apache has no permissions to delete these files, and they stay on the server, potentially exposing your site to attacks (Not always the case, but who wants to keep old files anyway?).
sr_rs: Kad se jezgro unapredi, ostanu neke datoteke koje više nisu potrebne WordPress-u i treba ih ukloniti. U nekim slučajevima, PHP/Apache nema dozvole da obriše ove datoteke i one ostaju na serveru, potencijalno izlažući vaš site napadima (Nije uvek tako, ali ko uopšte želi da čuva stare datoteke?)

source: Old Core Files notifies the user when old core files which are due removal exist in the filesystem
sr_rs: Old Core Files obaveštava korisnika da u sistemu datoteka postoje stare datoteke jezgra koje treba ukloniti
