Repository: wp-plugins/old-core-files
Catalog: languages/old-core-files-*.po
Languages: he_il

source: wp-admin Files
he_il: קבצי wp-admin

source: Old Core Files
he_il: קבצי ליבה ישנים

source: About
he_il: אודות

source: Existing
he_il: קיימים

source: All
he_il: הכל

source: We have found some old files in this WordPress installation. Please review the files below.
he_il: נמצאו קבצי ליבה ישנים בהתקנת וורדפרס זו. למטה ניתן לראות את רשימת הקבצים.

source: File
he_il: קובץ

source: Actions
he_il: פעולות

source: Delete
he_il: מחיקה

source: %d files in total
he_il: %d קבצים בסך הכל

source: Delete All
he_il: מחק הכל

source: Seems like there are no old files in your installation. Dont forget to delete old WordPress files after each upgrade.
he_il: נראה כי בהתקנת וורדפרס זו אין קבצי ליבה ישנים.

source: What is this about?
he_il: במה מדובר?

source: When core is being upgraded, there are some files that are no longer needed by WordPress, and they are set for removal. On some occasions, PHP/Apache has no permissions to delete these files, and they stay on the server, potentially exposing your site to attacks (Not always the case, but who wants to keep old files anyway?).
he_il: כאשר משדרגים לגרסת וורדפרס חדשה, קבצים מסויימים אינם נחוצים עוד, והם מיועדים למחיקה. במקרים מסויימים, אין הרשאות PHP/Apache למחוק קבצים אלה, והם נותרים על השרת, ועלולים לחשוף את האתר להתקפות (לא תמיד זהו המקרה, אבל מי ירצה לשמור על קבצים ישנים?).

source: Old Core Files notifies the user when old core files which are due removal exist in the filesystem
he_il: קבצי ליבה ישנים מציג למשתמש האם בהתקנת הוורדפרס קיימים קבצי ליבה שאינם בשימוש וניתנים למחיקה.

source: Maor Chasen, Rami Yushuvaev
he_il: מאור חזן, רמי יושובייב
